{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "#": 5,
      "$": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "0": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "8": 18,
      "9": 19,
      "=": 20,
      "B": 21,
      "K": 22,
      "N": 23,
      "O": 24,
      "Q": 25,
      "R": 26,
      "a": 27,
      "b": 28,
      "c": 29,
      "d": 30,
      "e": 31,
      "f": 32,
      "g": 33,
      "h": 34,
      "x": 35,
      "..": 36,
      "d4": 37,
      "f6": 38,
      "d5": 39,
      "e3": 40,
      "c6": 41,
      "e4": 42,
      "e5": 43,
      "10": 44,
      "11": 45,
      "12": 46,
      "13": 47,
      "14": 48,
      "15": 49,
      "16": 50,
      "17": 51,
      "f3": 52,
      "f5": 53,
      "18": 54,
      "19": 55,
      "20": 56,
      "21": 57,
      "22": 58,
      "23": 59,
      "d3": 60,
      "d7": 61,
      "e6": 62,
      "e7": 63,
      "f4": 64,
      "c3": 65,
      "e2": 66,
      "24": 67,
      "25": 68,
      "26": 69,
      "27": 70,
      "c4": 71,
      "d6": 72,
      "28": 73,
      "29": 74,
      "30": 75,
      "31": 76,
      "c5": 77,
      "d2": 78,
      "e1": 79,
      "f2": 80,
      "g4": 81,
      "h3": 82,
      "32": 83,
      "33": 84,
      "b5": 85,
      "c8": 86,
      "g5": 87,
      "a3": 88,
      "f1": 89,
      "g6": 90,
      "h5": 91,
      "h6": 92,
      "34": 93,
      "35": 94,
      "36": 95,
      "a6": 96,
      "b3": 97,
      "b4": 98,
      "d8": 99,
      "f8": 100,
      "37": 101,
      "b6": 102,
      "c7": 103,
      "d1": 104,
      "e8": 105,
      "g3": 106,
      "h4": 107,
      "g2": 108,
      "g7": 109,
      "h2": 110,
      "b1": 111,
      "b7": 112,
      "38": 113,
      "39": 114,
      "40": 115,
      "41": 116,
      "a2": 117,
      "a4": 118,
      "a5": 119,
      "b2": 120,
      "b8": 121,
      "c1": 122,
      "f7": 123,
      "g1": 124,
      "g8": 125,
      "h1": 126,
      "42": 127,
      "c2": 128,
      "h7": 129,
      "43": 130,
      "44": 131,
      "45": 132,
      "46": 133,
      "47": 134,
      "48": 135,
      "49": 136,
      "50": 137,
      "51": 138,
      "52": 139,
      "53": 140,
      "54": 141,
      "55": 142,
      "56": 143,
      "57": 144,
      "58": 145,
      "59": 146,
      "60": 147,
      "61": 148,
      "62": 149,
      "63": 150,
      "64": 151,
      "65": 152,
      "66": 153,
      "67": 154,
      "68": 155,
      "69": 156,
      "70": 157,
      "71": 158,
      "72": 159,
      "73": 160,
      "74": 161,
      "a1": 162,
      "fe1": 163,
      "1e7": 164,
      "1c7": 165,
      "5f2": 166,
      "a8": 167,
      "ae1": 168,
      "af1": 169,
      "ad8": 170,
      "ad1": 171,
      "ae8": 172,
      "ag3": 173,
      "ac1": 174,
      "bd7": 175,
      "bc3": 176,
      "bd2": 177,
      "be1": 178,
      "dd3": 179,
      "dd7": 180,
      "dd6": 181,
      "dg8": 182,
      "ee7": 183,
      "fd7": 184,
      "fd1": 185,
      "fc1": 186,
      "fg8": 187,
      "ge2": 188,
      "h8": 189,
      "he7": 190,
      "hd8": 191,
      "hg3": 192,
      "hg8": 193
    },
    "merges": [
      [
        ".",
        "."
      ],
      [
        "d",
        "4"
      ],
      [
        "f",
        "6"
      ],
      [
        "d",
        "5"
      ],
      [
        "e",
        "3"
      ],
      [
        "c",
        "6"
      ],
      [
        "e",
        "4"
      ],
      [
        "e",
        "5"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "2"
      ],
      [
        "1",
        "3"
      ],
      [
        "1",
        "4"
      ],
      [
        "1",
        "5"
      ],
      [
        "1",
        "6"
      ],
      [
        "1",
        "7"
      ],
      [
        "f",
        "3"
      ],
      [
        "f",
        "5"
      ],
      [
        "1",
        "8"
      ],
      [
        "1",
        "9"
      ],
      [
        "2",
        "0"
      ],
      [
        "2",
        "1"
      ],
      [
        "2",
        "2"
      ],
      [
        "2",
        "3"
      ],
      [
        "d",
        "3"
      ],
      [
        "d",
        "7"
      ],
      [
        "e",
        "6"
      ],
      [
        "e",
        "7"
      ],
      [
        "f",
        "4"
      ],
      [
        "c",
        "3"
      ],
      [
        "e",
        "2"
      ],
      [
        "2",
        "4"
      ],
      [
        "2",
        "5"
      ],
      [
        "2",
        "6"
      ],
      [
        "2",
        "7"
      ],
      [
        "c",
        "4"
      ],
      [
        "d",
        "6"
      ],
      [
        "2",
        "8"
      ],
      [
        "2",
        "9"
      ],
      [
        "3",
        "0"
      ],
      [
        "3",
        "1"
      ],
      [
        "c",
        "5"
      ],
      [
        "d",
        "2"
      ],
      [
        "e",
        "1"
      ],
      [
        "f",
        "2"
      ],
      [
        "g",
        "4"
      ],
      [
        "h",
        "3"
      ],
      [
        "3",
        "2"
      ],
      [
        "3",
        "3"
      ],
      [
        "b",
        "5"
      ],
      [
        "c",
        "8"
      ],
      [
        "g",
        "5"
      ],
      [
        "a",
        "3"
      ],
      [
        "f",
        "1"
      ],
      [
        "g",
        "6"
      ],
      [
        "h",
        "5"
      ],
      [
        "h",
        "6"
      ],
      [
        "3",
        "4"
      ],
      [
        "3",
        "5"
      ],
      [
        "3",
        "6"
      ],
      [
        "a",
        "6"
      ],
      [
        "b",
        "3"
      ],
      [
        "b",
        "4"
      ],
      [
        "d",
        "8"
      ],
      [
        "f",
        "8"
      ],
      [
        "3",
        "7"
      ],
      [
        "b",
        "6"
      ],
      [
        "c",
        "7"
      ],
      [
        "d",
        "1"
      ],
      [
        "e",
        "8"
      ],
      [
        "g",
        "3"
      ],
      [
        "h",
        "4"
      ],
      [
        "g",
        "2"
      ],
      [
        "g",
        "7"
      ],
      [
        "h",
        "2"
      ],
      [
        "b",
        "1"
      ],
      [
        "b",
        "7"
      ],
      [
        "3",
        "8"
      ],
      [
        "3",
        "9"
      ],
      [
        "4",
        "0"
      ],
      [
        "4",
        "1"
      ],
      [
        "a",
        "2"
      ],
      [
        "a",
        "4"
      ],
      [
        "a",
        "5"
      ],
      [
        "b",
        "2"
      ],
      [
        "b",
        "8"
      ],
      [
        "c",
        "1"
      ],
      [
        "f",
        "7"
      ],
      [
        "g",
        "1"
      ],
      [
        "g",
        "8"
      ],
      [
        "h",
        "1"
      ],
      [
        "4",
        "2"
      ],
      [
        "c",
        "2"
      ],
      [
        "h",
        "7"
      ],
      [
        "4",
        "3"
      ],
      [
        "4",
        "4"
      ],
      [
        "4",
        "5"
      ],
      [
        "4",
        "6"
      ],
      [
        "4",
        "7"
      ],
      [
        "4",
        "8"
      ],
      [
        "4",
        "9"
      ],
      [
        "5",
        "0"
      ],
      [
        "5",
        "1"
      ],
      [
        "5",
        "2"
      ],
      [
        "5",
        "3"
      ],
      [
        "5",
        "4"
      ],
      [
        "5",
        "5"
      ],
      [
        "5",
        "6"
      ],
      [
        "5",
        "7"
      ],
      [
        "5",
        "8"
      ],
      [
        "5",
        "9"
      ],
      [
        "6",
        "0"
      ],
      [
        "6",
        "1"
      ],
      [
        "6",
        "2"
      ],
      [
        "6",
        "3"
      ],
      [
        "6",
        "4"
      ],
      [
        "6",
        "5"
      ],
      [
        "6",
        "6"
      ],
      [
        "6",
        "7"
      ],
      [
        "6",
        "8"
      ],
      [
        "6",
        "9"
      ],
      [
        "7",
        "0"
      ],
      [
        "7",
        "1"
      ],
      [
        "7",
        "2"
      ],
      [
        "7",
        "3"
      ],
      [
        "7",
        "4"
      ],
      [
        "a",
        "1"
      ],
      [
        "f",
        "e1"
      ],
      [
        "1",
        "e7"
      ],
      [
        "1",
        "c7"
      ],
      [
        "5",
        "f2"
      ],
      [
        "a",
        "8"
      ],
      [
        "a",
        "e1"
      ],
      [
        "a",
        "f1"
      ],
      [
        "a",
        "d8"
      ],
      [
        "a",
        "d1"
      ],
      [
        "a",
        "e8"
      ],
      [
        "a",
        "g3"
      ],
      [
        "a",
        "c1"
      ],
      [
        "b",
        "d7"
      ],
      [
        "b",
        "c3"
      ],
      [
        "b",
        "d2"
      ],
      [
        "b",
        "e1"
      ],
      [
        "d",
        "d3"
      ],
      [
        "d",
        "d7"
      ],
      [
        "d",
        "d6"
      ],
      [
        "d",
        "g8"
      ],
      [
        "e",
        "e7"
      ],
      [
        "f",
        "d7"
      ],
      [
        "f",
        "d1"
      ],
      [
        "f",
        "c1"
      ],
      [
        "f",
        "g8"
      ],
      [
        "g",
        "e2"
      ],
      [
        "h",
        "8"
      ],
      [
        "h",
        "e7"
      ],
      [
        "h",
        "d8"
      ],
      [
        "h",
        "g3"
      ],
      [
        "h",
        "g8"
      ]
    ]
  }
}